AUTO_config_TK_pesok/src/DataProcessors/УправлениеПромоакциями/УправлениеПромоакциями.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>УправлениеПромоакциями</name>
  <attributes>
    <name>Промоакция</name>
    <type>
      <types>CatalogRef.Промоакции</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлуМониторинга</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокНоменклатуры</name>
    <attributes>
      <name>Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <comment>(АСУ) Характеристика/серия номенклатуры</comment>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Промоакция</name>
      <type>
        <types>CatalogRef.Промоакции</types>
      </type>
    </attributes>
    <attributes>
      <name>Менеджер</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипНоменклатуры</name>
      <comment>Категория (Тип номенклатуры)</comment>
      <type>
        <types>CatalogRef.ТипНоменклатурыПланирования</types>
      </type>
    </attributes>
    <attributes>
      <name>ид</name>
      <comment>уникальный идентификатор</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТорговаяМарка</name>
      <type>
        <types>CatalogRef.ТоварныеМарки</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусПозиции</name>
      <type>
        <types>EnumRef.ВидСтатусаСогласованияПромоакций</types>
      </type>
    </attributes>
    <attributes>
      <name>Покрытие</name>
      <type>
        <types>CatalogRef.Покрытия</types>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеОтгрузки</name>
      <type>
        <types>EnumRef.Аутсорс_УсловияОтгрузки</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорИзлишки</name>
      <type>
        <types>EnumRef.Аутсорс_ДогСКонтрагентомПоОкончанииППИзлишкиУсловие</types>
      </type>
    </attributes>
    <attributes>
      <name>Компенсация1шт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РозничнаяЦенаДоАкции</name>
      <comment>Розничная цена (80% покрытия), грн</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РозничнаяЦена</name>
      <comment>Розничная цена (80% покрытия), грн</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <comment>Договор по которому ведутся взаиморасчеты с контрагентом</comment>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоАкционнаяЦена</name>
      <comment>Закупочная</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АкционнаяЦена</name>
      <comment>Закупочная</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РекламаСтраница</name>
      <type>
        <types>EnumRef.ВидСтраницыРеклама</types>
      </type>
    </attributes>
    <attributes>
      <name>РекламаБорд</name>
      <type>
        <types>EnumRef.ВидБордаРеклама</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентКомпенсации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемПродажПредПериод</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемПродажАкционный</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипРозничнойЦены</name>
      <type>
        <types>CatalogRef.ТипыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоходОтТекущихПродаж</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоходностьОтТекущихПродаж</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемыйДоходБезКомпенсации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемаяДоходностьБезКомпенсации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемаяКомпенсация</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогоДоходСКомпенсации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемаяДоходностьСКомпенсацией</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриростВДоходе</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоТТ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗагрузки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Мониторинг</name>
      <type>
        <types>EnumRef.РезультатыМониторингаПромоакций</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПоследнегоМониторинга</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>РекомендуемаяРозничнаяЦена</name>
      <comment>Розничная цена (80% покрытия), грн</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДМП</name>
      <type>
        <types>EnumRef.ДМП</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗакупочнойЦены</name>
      <type>
        <types>CatalogRef.ТипыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>МинимальнаяЦенаМониторинга</name>
      <comment>Минимальная цена мониторинга</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоОтгрузки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеОтгрузки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасшифровкаПромо</name>
    <attributes>
      <name>ТорговаяПлощадка</name>
      <type>
        <types>CatalogRef.ТорговыеПлощадки</types>
      </type>
    </attributes>
    <attributes>
      <name>АкционныйОбьем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбьемЗаПредПериод</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

AUTO_config_TK_pesok/src/InformationRegisters/ИсторияМониторингов/ИсторияМониторингов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияМониторингов</name>
  <attributes>
    <name>СохраненныеДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Промоакция</name>
    <type>
      <types>CatalogRef.Промоакции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AUTO_config_TK_pesok/src/DataProcessors/УправлениеПромоакциями/Forms/ИсторияМониторингов/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	фильтрСписка ();	

КонецПроцедуры

&НаСервере
процедура фильтрСписка ()
	
	Параметры.Свойство("Промоакция",объект.Промоакция);
	отборПромоакция=ИсторияМониторингов.КомпоновщикНастроек.Настройки.Отбор.Элементы.Получить(0);
	отборПромоакция.ЛевоеЗначение=новый ПолеКомпоновкиДанных("Промоакция");
	отборПромоакция.ПравоеЗначение = объект.Промоакция;
	отборПромоакция.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	отборПромоакция.Использование = Истина;
	
	////если энто админ, не используем отбор по менеджеру
	отборменеджер=ИсторияМониторингов.КомпоновщикНастроек.Настройки.Отбор.Элементы.Получить(1);
	//отборменеджер.ПравоеЗначение = пользователи.АвторизованныйПользователь();
	//Если ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.ПолныеПрава)
	//	или ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.АдминистрированиеПромоакций) тогда
		отборменеджер.Использование=Ложь;
	//иначе
	//	отборменеджер.Использование=истина;				
	//КонецЕсли;	
КонецПроцедуры

&НаКлиенте
процедура фильтрСпискаНаКлиенте ()
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
			
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИсторияМониторинговПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
КонецПроцедуры

&НаКлиенте
Процедура Просмотр(Команда)
	//текДан = Элементы.ИсторияМониторингов.ТекущиеДанные;
	текСтр = Элементы.ИсторияМониторингов.ТекущаяСтрока;
	текФайл=получитьФайлИстории (текСтр);
	

	Если текФайл <> неопределено тогда
		#Если не ВебКлиент Тогда
			имяВременногоФайла = КаталогВременныхФайлов()+текФайл.ИмяФайла;
			текФайл.данные.Записать(имяВременногоФайла);			
			
			ЗапуститьПриложение(имяВременногоФайла);
			//Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
			//Диалог.Заголовок = "Укажите имя файла";
			////Диалог.ПолноеИмяФайла = Объект.Путь; 
			//Фильтр = "Файл Эксель 2008 (*.xlsx)|*.xlsx|Файл Эксель  (*.xls)|*.xls"; 
			//Диалог.Фильтр = Фильтр; 
			//Диалог.МножественныйВыбор = Ложь;
			//Если Диалог.Выбрать() Тогда
			//	
			//	
			//	
			//КонецЕсли;
		#иначе
			списокКнопокВопроса = новый СписокЗначений ();
			списокКнопокВопроса.Добавить("Показать","Показать");
			списокКнопокВопроса.Добавить("Скачать","Скачать");
			списокКнопокВопроса.Добавить("Отмена","Отмена");
			оповещение = новый ОписаниеОповещения("ОбработатьОтветНаВопрос",ЭтотОбъект,текФайл);
			ПоказатьВопрос(оповещение,"Выберите действие",списокКнопокВопроса,30,"Показать","Что хотите сделать?","Отмена");
		#КонецЕсли
	иначе
		сообщить ("нет данных для отображения");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОтветНаВопрос (РезультатВопроса,ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = "Показать" тогда
		табДок=получитьТабДокДляВебКлиента (ДополнительныеПараметры);
		табДок.Показать(ДополнительныеПараметры.ИмяФайла,ДополнительныеПараметры.ИмяФайла);		
	ИначеЕсли  РезультатВопроса = "Скачать" тогда
		ВремХранилище = ПоместитьВоВременноеХранилище(ДополнительныеПараметры.данные,ЭтаФорма.УникальныйИдентификатор);
		НачатьПолучениеФайлаССервера(ВремХранилище, ДополнительныеПараметры.ИмяФайла);		
	иначе
		Возврат;	
	КонецЕсли;
КонецПроцедуры

&НаСервере
функция получитьТабДокДляВебКлиента (текФайл)
	//дд = новый ДвоичныеДанные;
	//дд.НачатьЗапись(
	имяВременногоФайла = КаталогВременныхФайлов()+текФайл.ИмяФайла;
	текФайл.данные.Записать(имяВременногоФайла);
	табДок = новый ТабличныйДокумент;
	табДок.Прочитать(имяВременногоФайла,СпособЧтенияЗначенийТабличногоДокумента.Значение);
	Возврат табДок;
КонецФункции

&НаСервере
функция получитьФайлИстории (текСтр)
	мз = РегистрыСведений.ИсторияМониторингов.СоздатьМенеджерЗаписи();
	структураВозврата = новый структура ("ИмяФайла,данные");
	ЗаполнитьЗначенияСвойств(мз,текСтр);	
	мз.Прочитать();
	если мз.Выбран() тогда
		структураВозврата.ИмяФайла = мз.ИмяФайла;
		структураВозврата.данные = мз.СохраненныеДанные.Получить();
		возврат структураВозврата;
	иначе
		возврат неопределено;
	КонецЕсли;
КонецФункции
